//  0. Вывести квадрат числа

System.Console.Write("Введите число: ");
int n = int.Parse(Console.ReadLine());
int result = n*n;
System.Console.WriteLine($"Квадрат числа {n}: {result}");